enunciado/lang-spec-partial.org
#+TITLE:     Especificação da linguagem Lang
#+SUBTITLE:  Construção de Compiladores I
#+AUTHOR:    Prof. Rodrigo Ribeiro
#+EMAIL:     rodrigo.ribeiro@ufop.edu.br
#+DATE:      {{{time(%d-%m-%Y)}}}
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t ^:nil _:nil
#+OPTIONS:   H:3 num:nil
#+STARTUP:   showall
#+STARTUP:   align
#+latex_class: article
#+latex_class_options: [a4paper,11pt]
#+LATEX_HEADER: \usepackage[table]{xcolor}
#+LATEX_HEADER: \usepackage[margin=0.9in,bmargin=1.0in,tmargin=1.0in]{geometry}
#+LATEX_HEADER: \usepackage{algorithm2e}
#+LATEX_HEADER: \usepackage{algorithm}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{arydshln}
#+LATEX_HEADER: \usepackage{subcaption}
#+LaTeX_HEADER: \newcommand{\point}[1]{\noindent \textbf{#1}}
#+LaTeX_HEADER: \usepackage{hyperref}
#+LaTeX_HEADER: \usepackage{csquotes}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{bm}
#+LATEX_HEADER: \usepackage{proof, float}
#+LATEX_HEADER: \usepackage{subfig}
#+LaTeX_HEADER: \usepackage[mla]{ellipsis}
#+LaTeX_HEADER: \parindent = 0em
#+LaTeX_HEADER: \setlength\parskip{.5\baselineskip}
#+LaTeX_HEADER: \usepackage{pgf}
#+LaTeX_HEADER: \usepackage{tikz}
#+LaTeX_HEADER: \usetikzlibrary{shapes,arrows,automata,quotes}
#+LaTeX_HEADER: \usepackage[latin1]{inputenc}
#+LATEX_HEADER: \usepackage{adjustbox}


#+LATEX: \newcommand{\lang}{$lang$}
#+LATEX: \newcommand{\disciplina}{BCC328 - Construção de Compiladores I}

* 1 - Introdução

Neste documento é apresentada a especificação da linguagem de programação que será usada na
implementação dos trabalhos da disciplina \disciplina, denominada /lang/.
A linguagem /lang/ tem
propósito meramente educacional, contendo construções que se assemelham a de várias linguagens
conhecidas. No entanto, /lang/ não é um subconjunto de nenhuma delas. A descrição da linguagem é
dividida entre os diversos aspectos da linguagem, a saber, léxico, sintático, sistema de tipos e
semântico.

É importante ressaltar que este documento serve como *referência* da linguagem e não constitui o
enunciado dos trabalhos a serem desenvolvidos. O enunciado dos trabalhos envolverá subtarefas
da implementação desta linguagem.


* 2 - Estrutura sintática

A Gramática 1 apresenta a gramática livre-de-contexto que descreve a sintaxe da linguagem
/lang/. Os meta-símbolos estão entre aspas simples, quando usados como tokens.
As palavras reservadas estão em negrito e os demais tokens escritos com letras maiúsculas. A notação
=[ E ]= denota que =E= é *opcional*, isto é, ou a gramática derivará o conteúdo entre
chaves ou $\lambda$. Por sua vez, a notação ={ E }= representa 0 ou mais ocorrências de =E=.

Em linhas gerais, um programa nesta linguagem é constituído por um conjunto de definições que podem ser
tipos de dados ou funções. A estrutura sintática da linguagem é dividida em:
/tipos de dados e declarações/, /funções/, /comandos/ e /expressões/.
Cada uma dessas estruturas são detalhadas nas subseções subsequentes.

\captionsetup[table]{name=Gramática}
\begin{table}
  \begin{tabular}{l@{\hspace{0.4cm}}c@{\hspace{0.4cm}}l}
    prog & $\rightarrow$ & \{def\} \\
    def  & $\to$ & data $|$ fun \\
    data & $\rightarrow$ & {\bf data} ID `\{' \{decl\} `\}' \\
    decl & $\rightarrow$ & ID `::' type `;' \\
    func & $\rightarrow$ & ID `(' [params] `)' [`:' type (`,' type)*] `\{' \{cmd\} `\}'  \\
    params & $\rightarrow$ & ID `::' type \{`,' ID `::' type\} \\
    type & $\rightarrow$ & type `[' `]' \\
         & $|$           &  btype\\
    btype & $\rightarrow$ & {\bf Int} \\
    & $|$ & {\bf Char} \\
    & $|$ & {\bf Bool} \\
    & $|$ & {\bf Float} \\
    & $|$ & ID \\
    cmd & $\rightarrow$ & `\{' \{cmd\} `\}' \\
    & $|$ & {\bf if} `(' exp `)' cmd \\
    & $|$ & {\bf if} `(' exp `)' cmd {\bf else} cmd \\
    & $|$ & {\bf iterate} `(' exp `)' cmd \\
    & $|$ & {\bf read} lvalue `;' \\
    & $|$ & {\bf print} exp `;' \\
    & $|$ & {\bf return} exp \{`,' exp\} `;' \\
    & $|$ & lvalue {\bf =} exp `;' \\
    & $|$ & ID {\bf =} exp `;'\\
    & $|$ & ID `(' [exps]  `)' [`$<$' lvalue \{`,' lvalue\}  `$>$']  `;' \\
    exp & $\rightarrow$ & exp \&\& exp \\
        & $\mid$        & exp {\bf $<$} exp \\
        & $\mid$        & exp {\bf ==} exp \\
        & $\mid$        & exp {\bf !=} exp \\
        & $\mid$        & exp {\bf +} exp \\
        & $\mid$        & exp {\bf -} exp \\
        & $\mid$        & exp {\bf *} exp \\
        & $\mid$        & exp {\bf /} exp \\
        & $\mid$        & exp {\bf \%} exp \\
        & $\mid$        & ! exp \\
        & $\mid$        & - exp \\
        & $\mid$        & {\bf true} \\
        & $\mid$        & {\bf false} \\
        & $\mid$        & {\bf null} \\
        & $\mid$        & INT \\
        & $\mid$        & FLOAT \\
        & $\mid$        & CHAR \\
        & $\mid$        & lvalue \\
        & $\mid$        & `(' exp `)' \\
        & $\mid$        & {\bf new} type \{ `[' exp `]' \}  \\
        & $\mid$        & ID `(' [exps] `)' `[' exp `]' \\
    lvalue & $\rightarrow$ & ID \\
           & $\mid$ & lvalue `[' exp `]' \\
           & $\mid$ & lvalue {\bf .} ID \\
    exps & $\rightarrow$ & exp \{ {\bf ,} exp \}
  \end{tabular}
  \caption{Sintaxe da linguagem \lang}
  \label{fig:gram}
\end{table}

A seguir descrevemos alguns elementos da sintaxe de /lang/ utilizando exemplos.

** 2.1 - Tipos de dados e declarações

Programas /lang/  podem conter definições de tipos de dados registro, os quais são
definidos usando a palavra-chave *data*. Após a palavra-chave *data*, segue o nome
do novo tipo, o qual deve começar com uma letra maiúscula, e uma lista de declarações
de variáveis delimitadas por chaves. Por exemplo, um tipo para representar um número
racional pode ser definido como apresentado na Figura 1:

\begin{figure}[H]
\begin{verbatim}
data Racional {
   numerador :: Int;
   denominador :: Int;
}
\end{verbatim}
\caption{Exemplo de tipos de dados em Lang.}
\end{figure}

Esse tipo é denominado /Racional/ e contém dois atributos do tipo inteiro, um nomeado
de /numerador/ e o outro de /denominador/. A sintaxe para especificar os atributos de um
tipo registro é a mesma usada para declarações de variáveis de funções, i.e., nome do
atributo ou variável seguido por dois pontos, o tipo do atributo (variável) e finalizado
com um ponto e vírgula.

** 2.2 - Funções

A definição de funções e procedimentos é feita dando-se o nome da função (ou procedimento)
e a sua lista de parâmetros, delimitados por parêntesis. Parâmetros são seguidos por dois
pontos e os tipos de retorno, em caso de função. Note que uma função pode ter mais de um retorno,
os quais são separados por vírgula. Para procedimentos, não há informação sobre retorno, visto
que procedimentos não retornam valores. Por fim, segue o bloco de comandos. Um exemplo de programa
na linguagem /lang/ é apresentado a seguir, o qual contém a definição de um
procedimento denominado /main/ e as funções /fat/ e /divmod/.
A função /fat/ recebe um valor inteiro como parâmetro e tem como retorno o fatorial desse valor.
A função /divmod/ é um exemplo de função com mais de um valor de retorno.
Esta função recebe dois parâmetros inteiros e retorna o quociente e o resto da divisão do primeiro
pelo segundo parâmetro.

#+begin_src
main() {
  print fat(10)[0];
}

fat(num :: Int) : Int {
  if (num < 1)
    return 1;
  else
    return num * fat(num-1)[0];
}

divmod(num :: Int, div :: Int) : Int, Int {
  q = num / div;
  r = num % div;
  return q, r;
}
#+end_src

