enunciado/lang-spec-partial.tex
% Created 2023-10-28 sáb 09:59
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[table]{xcolor}
\usepackage[margin=0.9in,bmargin=1.0in,tmargin=1.0in]{geometry}
\usepackage{algorithm2e}
\usepackage{algorithm}
\usepackage{amsmath}
\usepackage{arydshln}
\usepackage{subcaption}
\newcommand{\point}[1]{\noindent \textbf{#1}}
\usepackage{hyperref}
\usepackage{csquotes}
\usepackage{graphicx}
\usepackage{bm}
\usepackage{proof, float}
\usepackage{subfig}
\usepackage[mla]{ellipsis}
\parindent = 0em
\setlength\parskip{.5\baselineskip}
\usepackage{pgf}
\usepackage{tikz}
\usetikzlibrary{shapes,arrows,automata,quotes}
\usepackage[latin1]{inputenc}
\usepackage{adjustbox}
\author{Prof. Rodrigo Ribeiro}
\date{28-10-2023}
\title{Especificação da linguagem Lang\\\medskip
\large Construção de Compiladores I}
\hypersetup{
 pdfauthor={Prof. Rodrigo Ribeiro},
 pdftitle={Especificação da linguagem Lang},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\newcommand{\lang}{$lang$}
\newcommand{\disciplina}{BCC328 - Construção de Compiladores I}
\section*{1 - Introdução}
\label{sec:orgea41eeb}

Neste documento é apresentada a especificação da linguagem de programação que será usada na
implementação dos trabalhos da disciplina \disciplina, denominada \emph{lang}.
A linguagem \emph{lang} tem
propósito meramente educacional, contendo construções que se assemelham a de várias linguagens
conhecidas. No entanto, \emph{lang} não é um subconjunto de nenhuma delas. A descrição da linguagem é
dividida entre os diversos aspectos da linguagem, a saber, léxico, sintático, sistema de tipos e
semântico.

É importante ressaltar que este documento serve como \textbf{referência} da linguagem e não constitui o
enunciado dos trabalhos a serem desenvolvidos. O enunciado dos trabalhos envolverá subtarefas
da implementação desta linguagem.
\section*{2 - Estrutura sintática}
\label{sec:org98c7b20}

A Gramática 1 apresenta a gramática livre-de-contexto que descreve a sintaxe da linguagem
\emph{lang}. Os meta-símbolos estão entre aspas simples, quando usados como tokens.
As palavras reservadas estão em negrito e os demais tokens escritos com letras maiúsculas. A notação
\texttt{[ E ]} denota que \texttt{E} é \textbf{opcional}, isto é, ou a gramática derivará o conteúdo entre
chaves ou \(\lambda\). Por sua vez, a notação \texttt{\{ E \}} representa 0 ou mais ocorrências de \texttt{E}.

Em linhas gerais, um programa nesta linguagem é constituído por um conjunto de definições que podem ser
tipos de dados ou funções. A estrutura sintática da linguagem é dividida em:
\emph{tipos de dados e declarações}, \emph{funções}, \emph{comandos} e \emph{expressões}.
Cada uma dessas estruturas são detalhadas nas subseções subsequentes.

\captionsetup[table]{name=Gramática}
\begin{table}
  \begin{tabular}{l@{\hspace{0.4cm}}c@{\hspace{0.4cm}}l}
    prog & $\rightarrow$ & \{def\} \\
    def  & $\to$ & data $|$ fun \\
    data & $\rightarrow$ & {\bf data} ID `\{' \{decl\} `\}' \\
    decl & $\rightarrow$ & ID `::' type `;' \\
    func & $\rightarrow$ & ID `(' [params] `)' [`:' type (`,' type)*] `\{' \{cmd\} `\}'  \\
    params & $\rightarrow$ & ID `::' type \{`,' ID `::' type\} \\
    type & $\rightarrow$ & type `[' `]' \\
         & $|$           &  btype\\
    btype & $\rightarrow$ & {\bf Int} \\
    & $|$ & {\bf Char} \\
    & $|$ & {\bf Bool} \\
    & $|$ & {\bf Float} \\
    & $|$ & ID \\
    cmd & $\rightarrow$ & `\{' \{cmd\} `\}' \\
    & $|$ & {\bf if} `(' exp `)' cmd \\
    & $|$ & {\bf if} `(' exp `)' cmd {\bf else} cmd \\
    & $|$ & {\bf iterate} `(' exp `)' cmd \\
    & $|$ & {\bf read} lvalue `;' \\
    & $|$ & {\bf print} exp `;' \\
    & $|$ & {\bf return} exp \{`,' exp\} `;' \\
    & $|$ & lvalue {\bf =} exp `;' \\
    & $|$ & ID {\bf =} exp `;'\\
    & $|$ & ID `(' [exps]  `)' [`$<$' lvalue \{`,' lvalue\}  `$>$']  `;' \\
    exp & $\rightarrow$ & exp \&\& exp \\
        & $\mid$        & exp {\bf $<$} exp \\
        & $\mid$        & exp {\bf ==} exp \\
        & $\mid$        & exp {\bf !=} exp \\
        & $\mid$        & exp {\bf +} exp \\
        & $\mid$        & exp {\bf -} exp \\
        & $\mid$        & exp {\bf *} exp \\
        & $\mid$        & exp {\bf /} exp \\
        & $\mid$        & exp {\bf \%} exp \\
        & $\mid$        & ! exp \\
        & $\mid$        & - exp \\
        & $\mid$        & {\bf true} \\
        & $\mid$        & {\bf false} \\
        & $\mid$        & {\bf null} \\
        & $\mid$        & INT \\
        & $\mid$        & FLOAT \\
        & $\mid$        & CHAR \\
        & $\mid$        & lvalue \\
        & $\mid$        & `(' exp `)' \\
        & $\mid$        & {\bf new} type \{ `[' exp `]' \}  \\
        & $\mid$        & ID `(' [exps] `)' `[' exp `]' \\
    lvalue & $\rightarrow$ & ID \\
           & $\mid$ & lvalue `[' exp `]' \\
           & $\mid$ & lvalue {\bf .} ID \\
    exps & $\rightarrow$ & exp \{ {\bf ,} exp \}
  \end{tabular}
  \caption{Sintaxe da linguagem \lang}
  \label{fig:gram}
\end{table}

A seguir descrevemos alguns elementos da sintaxe de \emph{lang} utilizando exemplos.
\subsection*{2.1 - Tipos de dados e declarações}
\label{sec:org11f7b7b}

Programas \emph{lang}  podem conter definições de tipos de dados registro, os quais são
definidos usando a palavra-chave \textbf{data}. Após a palavra-chave \textbf{data}, segue o nome
do novo tipo, o qual deve começar com uma letra maiúscula, e uma lista de declarações
de variáveis delimitadas por chaves. Por exemplo, um tipo para representar um número
racional pode ser definido como apresentado na Figura 1:

\begin{figure}[H]
\begin{verbatim}
data Racional {
   numerador :: Int;
   denominador :: Int;
}
\end{verbatim}
\caption{Exemplo de tipos de dados em Lang.}
\end{figure}

Esse tipo é denominado \emph{Racional} e contém dois atributos do tipo inteiro, um nomeado
de \emph{numerador} e o outro de \emph{denominador}. A sintaxe para especificar os atributos de um
tipo registro é a mesma usada para declarações de variáveis de funções, i.e., nome do
atributo ou variável seguido por dois pontos, o tipo do atributo (variável) e finalizado
com um ponto e vírgula.
\subsection*{2.2 - Funções}
\label{sec:org442a28c}

A definição de funções e procedimentos é feita dando-se o nome da função (ou procedimento)
e a sua lista de parâmetros, delimitados por parêntesis. Parâmetros são seguidos por dois
pontos e os tipos de retorno, em caso de função. Note que uma função pode ter mais de um retorno,
os quais são separados por vírgula. Para procedimentos, não há informação sobre retorno, visto
que procedimentos não retornam valores. Por fim, segue o bloco de comandos. Um exemplo de programa
na linguagem \emph{lang} é apresentado a seguir, o qual contém a definição de um
procedimento denominado \emph{main} e as funções \emph{fat} e \emph{divmod}.
A função \emph{fat} recebe um valor inteiro como parâmetro e tem como retorno o fatorial desse valor.
A função \emph{divmod} é um exemplo de função com mais de um valor de retorno.
Esta função recebe dois parâmetros inteiros e retorna o quociente e o resto da divisão do primeiro
pelo segundo parâmetro.

\begin{verbatim}
main() {
  print fat(10)[0];
}

fat(num :: Int) : Int {
  if (num < 1)
    return 1;
  else
    return num * fat(num-1)[0];
}

divmod(num :: Int, div :: Int) : Int, Int {
  q = num / div;
  r = num % div;
  return q, r;
}
\end{verbatim}
