enunciado/lang-spec-partial.tex
\subsection*{2.3 - Comandos}
\label{sec:orgee8d526}

A linguagem \emph{lang} apresenta apenas 8 comandos básico, classificados em comandos de atribuição,
seleção, entrada e saída, retorno, iteração e chamada de funções e procedimentos.

O comando de atribuição tem a mesma sintaxe das linguagens imperativas C/C++ e Java, na qual uma
expressão do lado esquerdo especifica o endereço que será armazenado o valor resultante da avaliação
da expressão do lado direito. A linguagem apresenta dois comados de seleção: um \emph{if-then} e \emph{if-then-else}.
Leitura e escrita da entrada/saída padrão são realizadas usando os comandos \textbf{read} e \textbf{print},
respectivamente. O comando \emph{read} é seguido por um endereço no qual será armazenado o valor lido da
entrada padrão e o comando \emph{print} é seguido por uma expressão. Os valores de retorno de uma função são
definidos por meio do comando \emph{return}, o qual é seguido por uma lista de expressões, separadas por vírgula.
A linguagem \emph{lang} apresenta apenas um comando de iteração com a seguinte estrutura:

\begin{verbatim}
iterate (expr) cmd
\end{verbatim}

O comando \textbf{iterate} especifica um trecho de código que será executado por uma quantidade de vezes determinada
pela avaliação da expressão delimitada entre parêntesis. Ressalta-se que a expressão é avaliada uma única vez e
o laço só será executado se o valor resultante da avaliação da expressão for maior que zero.

Chamadas de funções e procedimentos são comandos.
A sintaxe para chamada de procedimento é o nome do procedimento seguido por uma lista de expressões separadas
por vírgulas. Por exemplo, a chamada ao procedimento \emph{main} seria:

\begin{verbatim}
main();
\end{verbatim}

A chamada de função é similar, no entanto deve-se especificar uma lista de endereços para armazenar os valores de
retorno da função, como a seguinte chamada à função \emph{divmod}:
\begin{verbatim}
divmod(5,2)<q, r>;
\end{verbatim}

Este comando define que os valores de retorno da função serão atribuídos as variáveis \emph{q} e \emph{r}.

Por fim, um bloco de comandos é definido delimitando-se uma sequência de zero ou mais comandos por chaves.
\subsection*{2.4 - Expressões}
\label{sec:org29b2721}

Expressões são abstrações sobre valores e, em \emph{lang}, são muito semelhantes as expressões aritméticas de outras
linguagens, i.e., possuem os operadores aritméticos usuais (+,-,*,/,\%) além de operadores lógicos (\&\&, !), de
comparação (\(<\),==,!=) e  valores (inteiros, caracteres, booleanos, floats, registros, vetores e chamadas de funções).
Adicionalmente, parêntesis podem ser usados para determinar a \textbf{prioridade} de uma sub-expressão.

Observe, no entanto, que o conjunto de operadores é reduzido. Por exemplo, operações com valores lógicos (tipo booleano)
são realizadas com os operadores de conjunção (\&\&) e negação (!).
A linguagem não provê operadores para as demais operações lógicas. Como consequência, se queremos realizar uma seleção
quando o valor de ao menos uma de duas expressões, \(p\) e \(q\), resulta em verdadeira, escrevemos:

\begin{verbatim}
if(!(!p && !q)) { ... }
\end{verbatim}

As chamadas de funções são expressões. Porém, diferentemente das linguagens convencionais, usa-se um índice para determinar
qual dos valores de retorno da função será usado. Assim, a expressão \(divmod(5,2)[0]\) se refere ao primeiro retorno,
enquanto a expressão \(divmod(5,2)[1]\) ao segundo. Note que a indexação dos retornos da função é feita de maneira análoga ao
acesso de vetores, no qual o primeiro retorno é indexado por 0, o segundo por 1 e assim sucessivamente.

A expressão \(x*x+1 < fat(2*x)[0]\) contém operadores lógicos aritméticos e chamadas de funções.
Porém, em qual ordem as operações devem ser realizadas?  Se seguirmos a convenção adotada pela aritmética, primeiramente deve
ser resolvidas as \textbf{operações mais fortes} ou de \textbf{maior precedência}, i.e. a multiplicação e a divisão, seguida das
\textbf{operações mais fracas} ou de \textbf{menor precedência}, i.e. a soma e subtração. Assim certos operadores tem prioridade em relação
a outros operadores, i.e., devem ser resolvidos antes de outros.
Para a expressão \(x*x+1\) é fácil ver que a expressão \(x*x\) deve ser resolvida primeiro e em seguida deve-se somar \(1\) ao resultado.
E quando há operadores de tipos diferentes, como na expressão \(x*x+1 < fat(2*x)[0]\)?
A situação é semelhante, resolve-se o que tem maior precedência, a qual é determinada pela linguagem.
Neste exemplo, a última operação a ser realizada é a operação de comparação, cuja precedência é a menor dentre todos os
operadores da expressão. A Tabela 1 apresenta a precedência dos operadores da linguagem \emph{lang}.
O operador que tiver o maior valor da coluna \emph{nível} tem maior precedência.

\setcounter{table}{0}
\captionsetup[table]{name=Tabela}
\begin{table}
\begin{center}
\begin{tabular}{|c|c|c|c|}
  \hline \bf Nível & \bf Operador & \bf Descrição & \bf Associatividade \\
  \hline & [ ] & acesso a vetores &  \\
  7 &  . & acesso aos registros & esquerda \\
  & ( ) & parêntesis &  \\
  \hline   & & & \\
         6 & ! & negação lógica & direita \\
           & - & menos unário & \\
  \hline  & * & multiplicação  &  \\
        5 & / & divisão & esquerda \\
          & \% & resto &  \\
  \hline  & & & \\
         4 & + & adição & \\
           & - & subtração & esquerda \\
  \hline 3 & $<$ & relacional & não é associativo \\
  \hline   & & & \\
         2 & $==$ & igualdade & esquerda \\
           & $!=$ & diferença & \\
  \hline 1 & \&\& & conjunção & esquerda \\
  \hline
\end{tabular}
\caption{Tabela de associatividade e precedência dos operadores. Tem a maior precedência o operador de maior nível.}
\label{tab:prece}
\end{center}
\end{table}

Sabendo a precedência dos operadores podemos determinar em qual ordem as operações devem ser executadas quando há
operadores com diferentes níveis de precedência. Entretanto, como determinar a ordem das operações se uma determinada
expressão contém diferentes operadores com a mesma precedência, como nas expressões \(v[3].y[0]\) e \(x/3*y\)?

Em situações como essas, determinamos a ordem de avaliação das operações a partir da associatividade dos operadores,
que pode ser à esquerda ou à direita. Quando os operadores são associativos à esquerda, resolvemos a ordem das operações
da esquerda para a direita. Caso os operadores sejam associativos à direita, fazemos o inverso.
Em ambas as expressões \(v[3].y[0]\) e \(x/3*y\), os operadores são associativos à esquerda.
Portanto, na primeira expressão, primeiro é realizado o acesso ao vetor \(v\), depois acesso ao membro \(y\) e, por fim,
acesso ao vetor de \(y\). Na segunda expressão, realiza-se primeiro a divisão de \(x\) por 3 e, em seguida, a multiplicação
do resultado por \(y\).
