enunciado/lang-spec-partial.org
** 2.5 - Estrutura léxica

A linguagem usa o conjunto de caracteres da tabela [[http://www.asciitable.com][ASCII]]. Cada uma das possíveis categorias léxicas da linguagem são
descritas a seguir:

- Um *identificador* é uma sequência de letras, dígitos e sobrescritos (/underscore/) que, obrigatoriamente,
  começa com uma letra minúsculas. Exemplos de identificadores: /var/, /var1/ e /fun10/;
- Um *nome de tipo* é semelhante a regra de identificadores, porém a primeira letra é maiúscula;
  Exemplos de nomes de tipos: /Racional/ e /Point/;
- Um *literal inteiro* é uma sequência de um ou mais dígitos;
- Um *literal ponto flutuante* é uma sequência de zero ou mais digitos, seguido por um ponto e uma sequência
  de um ou mais digitos. Exemplos de literais ponto flutuante: 3.141526535, 1.0 e .12345;
- Um *literal caractere* é um único caractere delimitado por aspas simples.
  Os caracteres especiais quebra-de-linha, tabulação, /backspace/ e /carriage return/ são definidos usando os
  caracteres de escape \textbackslash n, \textbackslash t, \textbackslash b e \textbackslash r, respectivamente.
  Para especificar um caractere \textbackslash, é usado \textbackslash\textbackslash e para a aspas simples o
  \textbackslash'. Exemplos de literais caractere: 'a', '\textbackslash n', '\textbackslash t' e '\textbackslash\textbackslash';
- Um *literal lógico* é um dos valores *true* ou *false*;
- O *literal nulo* é *null*;
- Os símbolos usados para *operadores* e *separadores* são (, ), [, ], {, }, $>$, ;, :, ::, ., ,, =, $<$,
  *==*, *!=*, +, -, ***, /, %, && e !.

Todos os nomes de tipos, comandos e literais são palavras reservadas pela linguagem.
O comentário de uma linha começa com =--= e se estende até a quebra de linha.
A linguagem não suporta comentários com múltiplas linhas.
