enunciado/lang-spec-partial.tex
\subsection*{2.5 - Estrutura léxica}
\label{sec:orgcdb8a10}

A linguagem usa o conjunto de caracteres da tabela \href{http://www.asciitable.com}{ASCII}. Cada uma das possíveis categorias léxicas da linguagem são
descritas a seguir:

\begin{itemize}
\item Um \textbf{identificador} é uma sequência de letras, dígitos e sobrescritos (\emph{underscore}) que, obrigatoriamente,
começa com uma letra minúsculas. Exemplos de identificadores: \emph{var}, \emph{var1} e \emph{fun10};
\item Um \textbf{nome de tipo} é semelhante a regra de identificadores, porém a primeira letra é maiúscula;
Exemplos de nomes de tipos: \emph{Racional} e \emph{Point};
\item Um \textbf{literal inteiro} é uma sequência de um ou mais dígitos;
\item Um \textbf{literal ponto flutuante} é uma sequência de zero ou mais digitos, seguido por um ponto e uma sequência
de um ou mais digitos. Exemplos de literais ponto flutuante: 3.141526535, 1.0 e .12345;
\item Um \textbf{literal caractere} é um único caractere delimitado por aspas simples.
Os caracteres especiais quebra-de-linha, tabulação, \emph{backspace} e \emph{carriage return} são definidos usando os
caracteres de escape \textbackslash n, \textbackslash t, \textbackslash b e \textbackslash r, respectivamente.
Para especificar um caractere \textbackslash, é usado \textbackslash\textbackslash e para a aspas simples o
\textbackslash'. Exemplos de literais caractere: 'a', '\textbackslash n', '\textbackslash t' e '\textbackslash\textbackslash';
\item Um \textbf{literal lógico} é um dos valores \textbf{true} ou \textbf{false};
\item O \textbf{literal nulo} é \textbf{null};
\item Os símbolos usados para \textbf{operadores} e \textbf{separadores} são (, ), [, ], \{, \}, \(>\), ;, :, ::, ., ,, =, \(<\),
\textbf{==}, \textbf{!=}, +, -, \textbf{*}, /, \%, \&\& e !.
\end{itemize}

Todos os nomes de tipos, comandos e literais são palavras reservadas pela linguagem.
O comentário de uma linha começa com \texttt{-{}-{}} e se estende até a quebra de linha.
A linguagem não suporta comentários com múltiplas linhas.
\end{document}